{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function_type": "lambda", "output_shape": null, "trainable": true, "name": "lambda_1", "arguments": {}, "batch_input_shape": [null, 64, 64, 3], "output_shape_type": "raw", "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0013\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"trainable": true, "name": "convolution2d_1", "subsample": [2, 2], "W_constraint": null, "b_regularizer": null, "nb_col": 5, "W_regularizer": null, "b_constraint": null, "border_mode": "same", "activity_regularizer": null, "nb_filter": 24, "bias": true, "nb_row": 5, "activation": "linear", "init": "he_normal", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"strides": [1, 1], "trainable": true, "name": "maxpooling2d_1", "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "name": "convolution2d_2", "subsample": [2, 2], "W_constraint": null, "b_regularizer": null, "nb_col": 5, "W_regularizer": null, "b_constraint": null, "border_mode": "same", "activity_regularizer": null, "nb_filter": 36, "bias": true, "nb_row": 5, "activation": "linear", "init": "he_normal", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"strides": [1, 1], "trainable": true, "name": "maxpooling2d_2", "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "name": "convolution2d_3", "subsample": [2, 2], "W_constraint": null, "b_regularizer": null, "nb_col": 5, "W_regularizer": null, "b_constraint": null, "border_mode": "same", "activity_regularizer": null, "nb_filter": 48, "bias": true, "nb_row": 5, "activation": "linear", "init": "he_normal", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "MaxPooling2D", "config": {"strides": [1, 1], "trainable": true, "name": "maxpooling2d_3", "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "name": "convolution2d_4", "subsample": [1, 1], "W_constraint": null, "b_regularizer": null, "nb_col": 3, "W_regularizer": null, "b_constraint": null, "border_mode": "same", "activity_regularizer": null, "nb_filter": 64, "bias": true, "nb_row": 3, "activation": "linear", "init": "he_normal", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"strides": [1, 1], "trainable": true, "name": "maxpooling2d_4", "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "name": "convolution2d_5", "subsample": [1, 1], "W_constraint": null, "b_regularizer": null, "nb_col": 3, "W_regularizer": null, "b_constraint": null, "border_mode": "same", "activity_regularizer": null, "nb_filter": 64, "bias": true, "nb_row": 3, "activation": "linear", "init": "he_normal", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"strides": [1, 1], "trainable": true, "name": "maxpooling2d_5", "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_1", "init": "he_normal", "W_constraint": null, "b_regularizer": null, "input_dim": 1600, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "bias": true, "output_dim": 1164, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_6", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_2", "init": "he_normal", "W_constraint": null, "b_regularizer": null, "input_dim": 1164, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "bias": true, "output_dim": 100, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_7", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_3", "init": "he_normal", "W_constraint": null, "b_regularizer": null, "input_dim": 100, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "bias": true, "output_dim": 50, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_8", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_4", "init": "he_normal", "W_constraint": null, "b_regularizer": null, "input_dim": 50, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "bias": true, "output_dim": 10, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_9", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_5", "init": "he_normal", "W_constraint": null, "b_regularizer": null, "input_dim": 10, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "bias": true, "output_dim": 1, "activation": "linear"}}], "keras_version": "1.2.0"}