{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "name": "lambda_1", "output_shape": null, "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0014\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "batch_input_shape": [null, 64, 64, 3], "arguments": {}, "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "nb_filter": 24, "border_mode": "same", "trainable": true, "init": "he_normal", "W_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_1", "b_constraint": null, "b_regularizer": null, "subsample": [2, 2], "nb_row": 5, "activation": "linear", "bias": true, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"strides": [1, 1], "name": "maxpooling2d_1", "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "nb_filter": 36, "border_mode": "same", "trainable": true, "init": "he_normal", "W_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_2", "b_constraint": null, "b_regularizer": null, "subsample": [2, 2], "nb_row": 5, "activation": "linear", "bias": true, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"strides": [1, 1], "name": "maxpooling2d_2", "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "nb_filter": 48, "border_mode": "same", "trainable": true, "init": "he_normal", "W_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_3", "b_constraint": null, "b_regularizer": null, "subsample": [2, 2], "nb_row": 5, "activation": "linear", "bias": true, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "MaxPooling2D", "config": {"strides": [1, 1], "name": "maxpooling2d_3", "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "nb_filter": 64, "border_mode": "same", "trainable": true, "init": "he_normal", "W_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_4", "b_constraint": null, "b_regularizer": null, "subsample": [1, 1], "nb_row": 3, "activation": "linear", "bias": true, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"strides": [1, 1], "name": "maxpooling2d_4", "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "nb_filter": 64, "border_mode": "same", "trainable": true, "init": "he_normal", "W_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_5", "b_constraint": null, "b_regularizer": null, "subsample": [1, 1], "nb_row": 3, "activation": "linear", "bias": true, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"strides": [1, 1], "name": "maxpooling2d_5", "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias": true, "trainable": true, "init": "he_normal", "output_dim": 1164, "W_regularizer": null, "name": "dense_1", "input_dim": 1600, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_6", "alpha": 1.0}}, {"class_name": "Dense", "config": {"bias": true, "trainable": true, "init": "he_normal", "output_dim": 100, "W_regularizer": null, "name": "dense_2", "input_dim": 1164, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_7", "alpha": 1.0}}, {"class_name": "Dense", "config": {"bias": true, "trainable": true, "init": "he_normal", "output_dim": 50, "W_regularizer": null, "name": "dense_3", "input_dim": 100, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_8", "alpha": 1.0}}, {"class_name": "Dense", "config": {"bias": true, "trainable": true, "init": "he_normal", "output_dim": 10, "W_regularizer": null, "name": "dense_4", "input_dim": 50, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_9", "alpha": 1.0}}, {"class_name": "Dense", "config": {"bias": true, "trainable": true, "init": "he_normal", "output_dim": 1, "W_regularizer": null, "name": "dense_5", "input_dim": 10, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "linear"}}]}